app/Controllers/Peminjam.php

    public function laporan()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('peminjaman p')
        ->select('p.*, pl.nama as nama_pelanggan, m.merek, m.noplat')
        ->join('pelanggan pl', 'pl.idpel = p.idpel')
        ->join('datamobil m', 'm.idmobil = p.idmobil')
        ->orderBy('p.tanggal', 'DESC');

        $data = [
            'title' => 'Laporan Peminjaman',
            'peminjaman' => $builder->get()->getResultArray()
---
SELECT `p`.*, `pl`.`nama` as `nama_pelanggan`, `m`.`merek`, `m`.`noplat`
FROM `peminjaman` `p`
JOIN `pelanggan` `pl` ON `pl`.`idpel` = `p`.`idpel`
JOIN `datamobil` `m` ON `m`.`idmobil` = `p`.`idmobil`
ORDER BY `p`.`tanggal` DESC

    public function cetakpdf()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('peminjaman p')
        ->select('p.*, pl.nama as nama_pelanggan, m.merek, m.noplat')
        ->join('pelanggan pl', 'pl.idpel = p.idpel')
        ->join('datamobil m', 'm.idmobil = p.idmobil');

        // Ambil parameter filter jika ada
        $tanggal_awal = $this->request->getGet('tanggal_awal');
        $tanggal_akhir = $this->request->getGet('tanggal_akhir');

        if ($tanggal_awal && $tanggal_akhir) {
            $builder->where('p.tanggal >=', $tanggal_awal)
                ->where('p.tanggal <=', $tanggal_akhir);
        }

        $data['peminjaman'] = $builder->orderBy('p.tanggal', 'DESC')
        ->get()
            ->getResultArray();
---
SELECT `p`.*, `pl`.`nama` as `nama_pelanggan`, `m`.`merek`, `m`.`noplat`
FROM `peminjaman` `p`
JOIN `pelanggan` `pl` ON `pl`.`idpel` = `p`.`idpel`
JOIN `datamobil` `m` ON `m`.`idmobil` = `p`.`idmobil`
WHERE `p`.`tanggal` >= '2024-12-23'
AND `p`.`tanggal` <= '2024-12-28'
ORDER BY `p`.`tanggal` DESC