app/Controllers/Pengembalian.php

SELECT `pg`.*, `p`.`tanggal`, `p`.`tanggalkembali`, `p`.`total`, `p`.`lama`, `pl`.`nama` as `nama_pelanggan`, `m`.`merek`, `m`.`noplat`
FROM `pengembalian` `pg`
JOIN `peminjaman` `p` ON `p`.`faktur` = `pg`.`faktur`
JOIN `pelanggan` `pl` ON `pl`.`idpel` = `p`.`idpel`
JOIN `datamobil` `m` ON `m`.`idmobil` = `p`.`idmobil`
ORDER BY `pg`.`tgldikembalikan` DESC
---
    public function laporan()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengembalian pg')
        ->select('pg.*, p.tanggal, p.tanggalkembali, p.total, p.lama,
                 pl.nama as nama_pelanggan, m.merek, m.noplat')
        ->join('peminjaman p', 'p.faktur = pg.faktur')
        ->join('pelanggan pl', 'pl.idpel = p.idpel')
        ->join('datamobil m', 'm.idmobil = p.idmobil')
        ->orderBy('pg.tgldikembalikan', 'DESC');

        $data = [
            'title' => 'Laporan Pengembalian',
            'pengembalian' => $builder->get()->getResultArray()

SELECT `pg`.*, `p`.`tanggal`, `p`.`tanggalkembali`, `p`.`total`, `p`.`lama`, `pl`.`nama` as `nama_pelanggan`, `m`.`merek`, `m`.`noplat`
FROM `pengembalian` `pg`
JOIN `peminjaman` `p` ON `p`.`faktur` = `pg`.`faktur`
JOIN `pelanggan` `pl` ON `pl`.`idpel` = `p`.`idpel`
JOIN `datamobil` `m` ON `m`.`idmobil` = `p`.`idmobil`
WHERE `pg`.`tgldikembalikan` >= '2024-12-23'
AND `pg`.`tgldikembalikan` <= '2024-12-30'
ORDER BY `pg`.`tgldikembalikan` DESC
---
    public function filter()
    {
        if ($this->request->isAJAX()) {
            try {
                $tanggal_awal = $this->request->getPost('tanggal_awal');
                $tanggal_akhir = $this->request->getPost('tanggal_akhir');

                $db = \Config\Database::connect();
                $builder = $db->table('pengembalian pg')
                ->select('pg.*, p.tanggal, p.tanggalkembali, p.total, p.lama,
                         pl.nama as nama_pelanggan, m.merek, m.noplat')
                ->join('peminjaman p', 'p.faktur = pg.faktur')
                ->join('pelanggan pl', 'pl.idpel = p.idpel')
                ->join('datamobil m', 'm.idmobil = p.idmobil')
                ->where('pg.tgldikembalikan >=', $tanggal_awal)
                    ->where('pg.tgldikembalikan <=', $tanggal_akhir)
                    ->orderBy('pg.tgldikembalikan', 'DESC');

                $data = $builder->get()->getResultArray();

SELECT `pg`.*, `p`.`tanggal`, `p`.`tanggalkembali`, `p`.`total`, `p`.`lama`, `pl`.`nama` as `nama_pelanggan`, `m`.`merek`, `m`.`noplat`
FROM `pengembalian` `pg`
JOIN `peminjaman` `p` ON `p`.`faktur` = `pg`.`faktur`
JOIN `pelanggan` `pl` ON `pl`.`idpel` = `p`.`idpel`
JOIN `datamobil` `m` ON `m`.`idmobil` = `p`.`idmobil`
ORDER BY `pg`.`tgldikembalikan` DESC
---
    public function cetakpdf()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengembalian pg')
        ->select('pg.*, p.tanggal, p.tanggalkembali, p.total, p.lama,
                 pl.nama as nama_pelanggan, m.merek, m.noplat')
        ->join('peminjaman p', 'p.faktur = pg.faktur')
        ->join('pelanggan pl', 'pl.idpel = p.idpel')
        ->join('datamobil m', 'm.idmobil = p.idmobil');

        // Ambil parameter filter jika ada
        $tanggal_awal = $this->request->getGet('tanggal_awal');
        $tanggal_akhir = $this->request->getGet('tanggal_akhir');

        if ($tanggal_awal && $tanggal_akhir) {
            $builder->where('pg.tgldikembalikan >=', $tanggal_awal)
                ->where('pg.tgldikembalikan <=', $tanggal_akhir);
        }

        $data['pengembalian'] = $builder->orderBy('pg.tgldikembalikan', 'DESC')
        ->get()
            ->getResultArray();