app/Models/ModelPeminjam.php

SELECT `peminjaman`.*, `pelanggan`.`idpel`, `pelanggan`.`nama`, `pelanggan`.`nohp`, `datamobil`.`noplat`, `datamobil`.`hrgsewa`
FROM `peminjaman`
LEFT JOIN `pelanggan` ON `peminjaman`.`idpel` = `pelanggan`.`idpel`
LEFT JOIN `datamobil` ON `peminjaman`.`idmobil` = `datamobil`.`idmobil`
---
    public function getPeminjam()
    {
        $builder = $this->db->table('peminjaman');

        $builder->select('peminjaman.*, pelanggan.idpel, pelanggan.nama, pelanggan.nohp, datamobil.noplat, datamobil.hrgsewa');
        $builder->join('pelanggan', 'peminjaman.idpel = pelanggan.idpel', 'left');
        $builder->join('datamobil', 'peminjaman.idmobil = datamobil.idmobil', 'left');

        // Kembalikan hasil query
        return $builder->get();

SELECT *
FROM `pelanggan`
---
    public function getPel()
    {
        $builder = $this->db->table('pelanggan');
        return $builder->get();

SELECT *
FROM `datamobil`
WHERE `status` = 'Tersedia'
---
    public function getMobil()
    {
        $builder = $this->db->table('datamobil')->where('status', 'Tersedia');
        return $builder->get();

DELETE FROM `peminjaman`
WHERE `idpeminjam` = '8'
---
    public function deletPeminjam($id)
    {
        $query = $this->db->table('peminjaman')->delete(array('idpeminjam' => $id));

UPDATE `peminjaman` SET `tanggal` = '2024-12-17', `idpel` = 'P-001', `idmobil` = 'M-003', `lama` = '2', `total` = '5000000'
WHERE `idpeminjam` = '1'
---
    public function updatePeminjam($data, $id)
    {
        $query = $this->db->table('peminjaman')->update($data, array('idpeminjam' => $id));