app/Models/ModelKaryawan.php

SELECT *
FROM `karyawan`
---
    public function getKaryawan()
    {
      $builder = $this->db->table('karyawan');
      return $builder->get();