app/Models/ModelDataMobil.php

UPDATE `datamobil` SET `status` = 'Tersedia'
WHERE `idmobil` = 'M-0001'
---
    public function updateDataMobil($data, $id)
    {
        $query = $this->db->table('datamobil')->update($data, array('idmobil' => $id));