app/Models/ModelPengembalian.php

    public function getPengembalian()
    {
        $builder = $this->db->table('pengembalian');

        $builder->select('pengembalian.*,tanggal,lama,total,tanggalkembali,denda,pelanggan.idpel, pelanggan.nama, pelanggan.nohp, datamobil.noplat, datamobil.hrgsewa');
        $builder->join('peminjaman', 'pengembalian.faktur = peminjaman.faktur', 'left');
        $builder->join('pelanggan', 'peminjaman.idpel = pelanggan.idpel', 'left');
        $builder->join('datamobil', 'peminjaman.idmobil = datamobil.idmobil', 'left');

        // Kembalikan hasil query
        return $builder->get();
---
SELECT `pengembalian`.*, `tanggal`, `lama`, `total`, `tanggalkembali`, `denda`, `pelanggan`.`idpel`, `pelanggan`.`nama`, `pelanggan`.`nohp`, `datamobil`.`noplat`, `datamobil`.`hrgsewa`
FROM `pengembalian`
LEFT JOIN `peminjaman` ON `pengembalian`.`faktur` = `peminjaman`.`faktur`
LEFT JOIN `pelanggan` ON `peminjaman`.`idpel` = `pelanggan`.`idpel`
LEFT JOIN `datamobil` ON `peminjaman`.`idmobil` = `datamobil`.`idmobil`

    public function getPeminjaman()
    {
        $builder = $this->db->table('peminjaman')
        ->join('pelanggan', 'peminjaman.idpel = pelanggan.idpel', 'left')
        ->join('datamobil', 'peminjaman.idmobil = datamobil.idmobil', 'left');
        return $builder->get();
---
SELECT *
FROM `peminjaman`
LEFT JOIN `pelanggan` ON `peminjaman`.`idpel` = `pelanggan`.`idpel`
LEFT JOIN `datamobil` ON `peminjaman`.`idmobil` = `datamobil`.`idmobil`