app/Models/ModelUser.php

    public function getUser()
    {
      $builder = $this->db->table('user');
      return $builder->get();
---
SELECT *
FROM `user`

    public function insertData($data)
    {
        $this->db->table('user')->insert($data);
---
INSERT INTO `user` (`id_user`, `nama_user`, `email`, `password`, `level`) VALUES ('U-0004', 'Jamal', 'jamal@gmail.com', '$2y$10$oZ/3KGEySSpeLGNnNS7hw.u38gyj00zlyo3LhrTmocUnDCZR0bsPC', '1')

    public function deletUser($id)
    {
        $query = $this->db->table('user')->delete(array('id_user' => $id));
---
DELETE FROM `user`
WHERE `id_user` = ''

    public function updateuser($data, $id)
    {
        $query = $this->db->table('user')->update($data, array('id_user' => $id));
---
UPDATE `user` SET `nama_user` = 'Nana', `email` = 'nana@gmail.com', `password` = '$2y$10$itN9Ze966yimUn.gvTMoI.UhDqqlVYkuIzqclyw4PDxME6aqTCfOK', `level` = '1'
WHERE `id_user` = 'U-001'